viys/Embedded/MCU_Code/GD32F1/GD32F103RC资料/代码/13.FREERTOS实验/Usr/LCD/GUI.c
#include "gd32e10x.h"
#include "Lcd_Driver.h"
#include "GUI.h"
#include "font.h"
#include "Font_CHS.h"

/****************************************************************************************
Function:
Description:
****************************************************************************************/
//从ILI93xx读出的数据为GBR格式，而我们写入的时候为RGB格式。
//通过该函数转换
//c:GBR格式的颜色值
//返回值：RGB格式的颜色值
unsigned short int LCD_BGR2RGB(unsigned short int c)
{
  unsigned short int  r,g,b,rgb;   
  b=(c>>0)&0x1f;
  g=(c>>5)&0x3f;
  r=(c>>11)&0x1f;	 
  rgb=(b<<11)+(g<<5)+(r<<0);		 
  return(rgb);

}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_Circle(unsigned short int X,unsigned short int Y,unsigned short int R,unsigned short int fc) 
{//Bresenham算法 
    unsigned short  a,b; 
    int c; 
    a=0; 
    b=R; 
    c=3-2*R; 
    while (a<b) 
    { 
        Gui_DrawPoint(X+a,Y+b,fc);     //        7 
        Gui_DrawPoint(X-a,Y+b,fc);     //        6 
        Gui_DrawPoint(X+a,Y-b,fc);     //        2 
        Gui_DrawPoint(X-a,Y-b,fc);     //        3 
        Gui_DrawPoint(X+b,Y+a,fc);     //        8 
        Gui_DrawPoint(X-b,Y+a,fc);     //        5 
        Gui_DrawPoint(X+b,Y-a,fc);     //        1 
        Gui_DrawPoint(X-b,Y-a,fc);     //        4 

        if(c<0) c=c+4*a+6; 
        else 
        { 
            c=c+4*(a-b)+10; 
            b-=1; 
        } 
       a+=1; 
    } 
    if (a==b) 
    { 
        Gui_DrawPoint(X+a,Y+b,fc); 
        Gui_DrawPoint(X+a,Y+b,fc); 
        Gui_DrawPoint(X+a,Y-b,fc); 
        Gui_DrawPoint(X-a,Y-b,fc); 
        Gui_DrawPoint(X+b,Y+a,fc); 
        Gui_DrawPoint(X-b,Y+a,fc); 
        Gui_DrawPoint(X+b,Y-a,fc); 
        Gui_DrawPoint(X-b,Y-a,fc); 
    } 
	
} 

/****************************************************************************************
Function:
Description:
****************************************************************************************/
//画线函数，使用Bresenham 画线算法
void Gui_DrawLine(unsigned short int x0, unsigned short int y0,unsigned short int x1, unsigned short int y1,unsigned short int Color)   
{
int dx,             // difference in x's
    dy,             // difference in y's
    dx2,            // dx,dy * 2
    dy2, 
    x_inc,          // amount in pixel space to move during drawing
    y_inc,          // amount in pixel space to move during drawing
    error,          // the discriminant i.e. error i.e. decision variable
    index;          // used for looping	


	Lcd_SetXY(x0,y0);
	dx = x1-x0;//计算x距离
	dy = y1-y0;//计算y距离

	if (dx>=0)
	{
		x_inc = 1;
	}
	else
	{
		x_inc = -1;
		dx    = -dx;  
	} 
	
	if (dy>=0)
	{
		y_inc = 1;
	} 
	else
	{
		y_inc = -1;
		dy    = -dy; 
	} 

	dx2 = dx << 1;
	dy2 = dy << 1;

	if (dx > dy)//x距离大于y距离，那么每个x轴上只有一个点，每个y轴上有若干个点
	{//且线的点数等于x距离，以x轴递增画点
		// initialize error term
		error = dy2 - dx; 

		// draw the line
		for (index=0; index <= dx; index++)//要画的点数不会超过x距离
		{
			//画点
			Gui_DrawPoint(x0,y0,Color);
			
			// test if error has overflowed
			if (error >= 0) //是否需要增加y坐标值
			{
				error-=dx2;

				// move to next line
				y0+=y_inc;//增加y坐标值
			} // end if error overflowed

			// adjust the error term
			error+=dy2;

			// move to the next pixel
			x0+=x_inc;//x坐标值每次画点后都递增1
		} // end for
	} // end if |slope| <= 1
	else//y轴大于x轴，则每个y轴上只有一个点，x轴若干个点
	{//以y轴为递增画点
		// initialize error term
		error = dx2 - dy; 

		// draw the line
		for (index=0; index <= dy; index++)
		{
			// set the pixel
			Gui_DrawPoint(x0,y0,Color);

			// test if error overflowed
			if (error >= 0)
			{
				error-=dy2;

				// move to next line
				x0+=x_inc;
			} // end if error overflowed

			// adjust the error term
			error+=dx2;

			// move to the next pixel
			y0+=y_inc;
		} // end for
	} // end else |slope| > 1
}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_box(unsigned short int x, unsigned short int y, unsigned short int w, unsigned short int h,unsigned short int bc)
{
	Gui_DrawLine(x,y,x+w,y,0xEF7D);
	Gui_DrawLine(x+w-1,y+1,x+w-1,y+1+h,0x2965);
	Gui_DrawLine(x,y+h,x+w,y+h,0x2965);
	Gui_DrawLine(x,y,x,y+h,0xEF7D);
    Gui_DrawLine(x+1,y+1,x+1+w-2,y+1+h-2,bc);
}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_box2(unsigned short int x,unsigned short int y,unsigned short int w,unsigned short int h, unsigned char mode)
{
	if (mode==0)	{
		Gui_DrawLine(x,y,x+w,y,0xEF7D);
		Gui_DrawLine(x+w-1,y+1,x+w-1,y+1+h,0x2965);
		Gui_DrawLine(x,y+h,x+w,y+h,0x2965);
		Gui_DrawLine(x,y,x,y+h,0xEF7D);
		}
	if (mode==1)	{
		Gui_DrawLine(x,y,x+w,y,0x2965);
		Gui_DrawLine(x+w-1,y+1,x+w-1,y+1+h,0xEF7D);
		Gui_DrawLine(x,y+h,x+w,y+h,0xEF7D);
		Gui_DrawLine(x,y,x,y+h,0x2965);
	}
	if (mode==2)	{
		Gui_DrawLine(x,y,x+w,y,0xffff);
		Gui_DrawLine(x+w-1,y+1,x+w-1,y+1+h,0xffff);
		Gui_DrawLine(x,y+h,x+w,y+h,0xffff);
		Gui_DrawLine(x,y,x,y+h,0xffff);
	}
}


/**************************************************************************************
功能描述: 在屏幕显示一凸起的按钮框
输    入: unsigned short int x1,y1,x2,y2 按钮框左上角和右下角坐标
输    出: 无
**************************************************************************************/
void DisplayButtonDown(unsigned short int x1,unsigned short int y1,unsigned short int x2,unsigned short int y2)
{
	Gui_DrawLine(x1,  y1,  x2,y1, GRAY2);  //H
	Gui_DrawLine(x1+1,y1+1,x2,y1+1, GRAY1);  //H
	Gui_DrawLine(x1,  y1,  x1,y2, GRAY2);  //V
	Gui_DrawLine(x1+1,y1+1,x1+1,y2, GRAY1);  //V
	Gui_DrawLine(x1,  y2,  x2,y2, WHITE);  //H
	Gui_DrawLine(x2,  y1,  x2,y2, WHITE);  //V
}

/**************************************************************************************
功能描述: 在屏幕显示一凹下的按钮框
输    入: unsigned short int x1,y1,x2,y2 按钮框左上角和右下角坐标
输    出: 无
**************************************************************************************/
void DisplayButtonUp(unsigned short int x1,unsigned short int y1,unsigned short int x2,unsigned short int y2)
{
	Gui_DrawLine(x1,  y1,  x2,y1, WHITE); //H
	Gui_DrawLine(x1,  y1,  x1,y2, WHITE); //V
	
	Gui_DrawLine(x1+1,y2-1,x2,y2-1, GRAY1);  //H
	Gui_DrawLine(x1,  y2,  x2,y2, GRAY2);  //H
	Gui_DrawLine(x2-1,y1+1,x2-1,y2, GRAY1);  //V
    Gui_DrawLine(x2  ,y1  ,x2,y2, GRAY2); //V
}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_DrawFont_GBK16(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned char *s)
{
	unsigned char i,j;
	unsigned short k,x0;
	x0=x;

	while(*s) 
	{
		// 刷英文字符
		if((*s) < 128)															// 是否为英文字符显示？
		{
			k=*s;
			if (k==13)															// 换行操作
			{
				x=x0;
				y+=16;
			}
			else 
			{
				if(k>32)	k-=32;
				else		k=0;
	
			    for(i=0;i<16;i++)												// 刷16行数据
				{
					for(j=0;j<8;j++)											// 刷每行8点
					{
				    	if(asc16[k*16+i]&(0x80>>j))	Gui_DrawPoint(x+j,y+i,fc);
						else
						{
							if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
						}
					}
				}
				x+=8;															// 更新X座标
			}
			s++;																// 取下一个字符
		}
			
		// 刷汉字字符
		else																	// 汉字字符显示
		{
			for (k=0;k<hz16_num;k++)											// 查找整个汉字字库
			{
				if ( (hz16[k].Index[0]==*(s)) && (hz16[k].Index[1]==*(s+1)) )	// 查找要显示的没字索引
				{ 
					for(i=0;i<16;i++)											// 刷16行数据
					{
						for(j=0;j<8;j++)										// 先取前半行数据
						{
							if(hz16[k].Msk[i*2]&(0x80>>j))	Gui_DrawPoint(x+j,y+i,fc);
							else 
							{
								if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
							}
						}
						for(j=0;j<8;j++)										// 再取后半行数据
						{
							if(hz16[k].Msk[i*2+1]&(0x80>>j))	Gui_DrawPoint(x+j+8,y+i,fc);
							else 
							{
								if (fc!=bc) Gui_DrawPoint(x+j+8,y+i,bc);
							}
						}
					}
				}
			}
			s+=2;x+=16;
		} 
		
	}
}


/****************************************************************************************
Function:
Description:
		注意：字模数据最低位5位有效
****************************************************************************************/
void Gui_DrawFont_asc2_5x7(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned char *s)
{
	#define		ASC2_5X7_ROW		7
	#define		ASC2_5X7_COLUMN		5
	unsigned char i,j;
	unsigned short k,x0;
	x0=x;

	while(*s) 
	{
		// 刷英文字符
		if((*s) < 128)																		// 是否为英文字符显示？
		{
			k=*s;
			if (k==13)																		// 换行操作
			{		
				x=x0;
				y+=ASC2_5X7_ROW;
			}
			else 
			{
				if(k>32)	k-=32;
				else		k=0;
	
			    for(i=0;i<ASC2_5X7_ROW;i++)													// 刷7行数据
				{
					for(j=0;j<ASC2_5X7_COLUMN;j++)										// 刷每行5点
					{
				    	if( asc2_5x7[k*ASC2_5X7_ROW+i]&(0x01<<j) )	Gui_DrawPoint(x+j,y+i,fc);// 取点数据
						else
						{
							if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
						}
					}
				}
				x+=ASC2_5X7_COLUMN+1;															// 更新X座标
			}
			s++;																			// 取下一个字符
		}
	}
}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_DrawFont_GBK12_8(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned char *s)
{
	unsigned char i,j;
	unsigned short k,x0;
	x0=x;

	while(*s) 
	{
		// 刷英文字符
		if((*s) < 128)																// 是否为英文字符显示？
		{
			k=*s;
			if (k==13)																// 换行操作
			{
				x=x0;
				y+=12;
			}
			else 
			{
				if(k>32)	k-=32;
				else		k=0;
	
			    for(i=0;i<12;i++)													// 刷12行数据
				{
					for(j=0;j<8;j++)												// 刷每行8点
					{
				    	if(asc12_8[k*12+i]&(0x80>>j))	Gui_DrawPoint(x+j,y+i,fc);	// 取点数据
						else
						{
							if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
						}
					}
				}
				x+=8;																// 更新X座标
			}
			s++;																	// 取下一个字符
		}
	}
}
		

/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_DrawFont_asc12x24(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned char *s)
{
	#define		ASC_12_24_ROW		24
	#define		ASC_12_24_COLUMN	12
	unsigned char i,j;
	unsigned short k,x0;
	x0=x;

	while(*s) 
	{
		// 刷英文字符
		if((*s) < 128)																// 是否为英文字符显示？
		{
			k=*s;
			if (k==13)																// 换行操作
			{
				x=x0;
				y+=ASC_12_24_ROW;
			}
			else 
			{
				if(k>32)	k-=32;
				else		k=0;
	
			    for(i=0;i<ASC_12_24_ROW;i++)										// 刷24行数据
				{
					for(j=0;j<8;j++)												// 刷每行12点
					{
				    	if(asc12x24[k*ASC_12_24_ROW*2+i*2]&(0x80>>j))	Gui_DrawPoint(x+j,y+i,fc);	// 取点数据
						else
						{
							if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
						}
					}
					for(j=0;j<4;j++)												// 刷每行12点
					{
				    	if(asc12x24[k*ASC_12_24_ROW*2+i*2+1]&(0x80>>j))	Gui_DrawPoint(x+j+8,y+i,fc);	// 取点数据
						else
						{
							if (fc!=bc) Gui_DrawPoint(x+j+8,y+i,bc);
						}
					}
				}
				x+=ASC_12_24_COLUMN;												// 更新X座标
			}
			s++;																	// 取下一个字符
		}
	}
}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_DrawFont_GBK32_16(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned char *s)
{
	#define		GBK32_16_ROW		32
	#define		GBK32_16_COLUMN		16
	unsigned char i,j;
	unsigned short k,x0;
	x0=x;

	while(*s) 
	{
		// 刷英文字符
		if((*s) < 128)															// 是否为英文字符显示？
		{
			k=*s;
			if (k==13)															// 换行操作
			{
				x=x0;
				y+=GBK32_16_ROW;
			}
			else 
			{
				if(k>32)	k-=32;
				else		k=0;
	
			    for(i=0;i<GBK32_16_ROW;i++)									// 刷32行数据
				{
					for(j=0;j<8;j++)											// 刷每行16点
					{
				    	if(asc32_16[k*GBK32_16_ROW*2+i*2]&(0x80>>j))	Gui_DrawPoint(x+j,y+i,fc);	// 取点数据
						else
						{
							if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
						}
					}
					for(j=0;j<8;j++)											// 刷每行16点
					{
				    	if(asc32_16[k*GBK32_16_ROW*2+i*2+1]&(0x80>>j))	Gui_DrawPoint(x+j+8,y+i,fc);	// 取点数据
						else
						{
							if (fc!=bc) Gui_DrawPoint(x+j+8,y+i,bc);
						}
					}
				}
				x+=GBK32_16_COLUMN;															// 更新X座标
			}
			s++;																// 取下一个字符
		}
	}
}

/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_DrawFont_GBK18(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned char *s)
{
	#define	GBK18_COLUMNS	18
	
	unsigned char i,j;
	unsigned short k;

	while(*s) 
	{
		if( *s < 0x80 ) 
		{
			k=*s;
			if (k>32) k-=32; else k=0;

		    for(i=0;i<16;i++)
			for(j=0;j<8;j++) 
			{
				if(asc16[k*16+i]&(0x80>>j))	
				Gui_DrawPoint(x+j,y+i,fc);
				else 
				{
					if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
				}
			}
			s++;x+=8;
		}
		else 
		{
			for (k=0;k<hz18_num;k++)		// 索引字符
			{
				if ((hz18[k].Index[0]==*(s))&&(hz18[k].Index[1]==*(s+1)))
				{ 
				    for(i=0;i<GBK18_COLUMNS;i++)
				    {
						for(j=0;j<8;j++) 
						{
							if(hz18[k].Msk[i*3]&(0x80>>j))
							Gui_DrawPoint(x+j,y+i,fc);
							else 
							{
								if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
							}
						}
						for(j=0;j<8;j++) 
						{
							if(hz18[k].Msk[i*3+1]&(0x80>>j))	Gui_DrawPoint(x+j+8,y+i,fc);
							else 
							{
								if (fc!=bc) Gui_DrawPoint(x+j+8,y+i,bc);
							}
						}
						for(j=0;j<2;j++) 
						{
							if(hz18[k].Msk[i*3+2]&(0x80>>j))	
							Gui_DrawPoint(x+j+16,y+i,fc);
							else 
							{
								if (fc!=bc) Gui_DrawPoint(x+j+16,y+i,bc);
							}
						}
				    }
				}
			}
			s+=2;x+=GBK18_COLUMNS;
		}
	}
}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_DrawFont_GBK24(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned char *s)
{
	unsigned char i,j;
	unsigned short k;

	while(*s) 
	{
		if( *s < 0x80 ) 
		{
			k=*s;
			if (k>32) k-=32; else k=0;

		    for(i=0;i<16;i++)
			for(j=0;j<8;j++) 
				{
			    	if(asc16[k*16+i]&(0x80>>j))	
					Gui_DrawPoint(x+j,y+i,fc);
					else 
					{
						if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
					}
				}
			s++;x+=8;
		}
		else 
		{

			for (k=0;k<hz24_num;k++) 
			{
			  if ((hz24[k].Index[0]==*(s))&&(hz24[k].Index[1]==*(s+1)))
			  { 
				    for(i=0;i<24;i++)
				    {
						for(j=0;j<8;j++) 
							{
						    	if(hz24[k].Msk[i*3]&(0x80>>j))
								Gui_DrawPoint(x+j,y+i,fc);
								else 
								{
									if (fc!=bc) Gui_DrawPoint(x+j,y+i,bc);
								}
							}
						for(j=0;j<8;j++) 
							{
						    	if(hz24[k].Msk[i*3+1]&(0x80>>j))	Gui_DrawPoint(x+j+8,y+i,fc);
								else {
									if (fc!=bc) Gui_DrawPoint(x+j+8,y+i,bc);
								}
							}
						for(j=0;j<8;j++) 
							{
						    	if(hz24[k].Msk[i*3+2]&(0x80>>j))	
								Gui_DrawPoint(x+j+16,y+i,fc);
								else 
								{
									if (fc!=bc) Gui_DrawPoint(x+j+16,y+i,bc);
								}
							}
				    }
			  }
			}
			s+=2;x+=24;
		}
	}
}


/****************************************************************************************
Function:
Description:
****************************************************************************************/
void Gui_DrawFont_Num32(unsigned short int x, unsigned short int y, unsigned short int fc, unsigned short int bc, unsigned short int num)
{
	unsigned char i,j,k,c;
	//lcd_text_any(x+94+i*42,y+34,32,32,0x7E8,0x0,sz32,knum[i]);
//	w=w/8;

    for(i=0;i<32;i++)
	{
		for(j=0;j<4;j++) 
		{
			c=*(sz32+num*32*4+i*4+j);
			for (k=0;k<8;k++)	
			{
	
		    	if(c&(0x80>>k))	Gui_DrawPoint(x+j*8+k,y+i,fc);
				else {
					if (fc!=bc) Gui_DrawPoint(x+j*8+k,y+i,bc);
				}
			}
		}
	}
}


